
Функция ПолучитьКрайнееФИО() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Тренировка.Спортсмен КАК Ссылка
		|ИЗ
		|	Документ.Тренировка КАК Тренировка
		|ГДЕ
		|	Тренировка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Тренировка.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка
	КонецЕсли;
	
	Возврат Справочники.Спортсмен.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьКрайнееВремяВосстановления() Экспорт
	
	Ответ	= Новый Массив;
	Запрос 	= Новый Запрос;
	
	Запрос.Текст =
	
#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ТНаборУпражнений.Стиль КАК Стиль,
		|	ТНаборУпражнений.Упражнение КАК Упражнение,
		|	ТНаборУпражнений.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТНаборУпражнений
		|ИЗ
		|	РегистрСведений.КонтрольВосстановления КАК ТНаборУпражнений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТренировкаЖурналТренировок.НомерСтроки) КАК НомерСтроки,
		|	ТренировкаЖурналТренировок.Стиль КАК Стиль,
		|	ТренировкаЖурналТренировок.Ссылка КАК Ссылка,
		|	ТНаборУпражнений.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТЖурналТренировок
		|ИЗ
		|	Документ.Тренировка.ЖурналТренировок КАК ТренировкаЖурналТренировок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНаборУпражнений КАК ТНаборУпражнений
		|		ПО ТренировкаЖурналТренировок.Упражнение = ТНаборУпражнений.Упражнение
		|			И ТренировкаЖурналТренировок.Стиль = ТНаборУпражнений.Стиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ТренировкаЖурналТренировок.Стиль,
		|	ТренировкаЖурналТренировок.Ссылка,
		|	ТНаборУпражнений.ГруппаМышц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТТренировка.Дата КАК Период,
		|	ТЖурналТренировок.НомерСтроки КАК НомерСтроки,
		|	ТЖурналТренировок.Стиль КАК Стиль,
		|	ТЖурналТренировок.Ссылка КАК Ссылка,
		|	ТЖурналТренировок.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТТренировка
		|ИЗ
		|	ВТЖурналТренировок КАК ТЖурналТренировок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Тренировка КАК ТТренировка
		|		ПО ТЖурналТренировок.Ссылка = ТТренировка.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Тренировка.Период) КАК Период,
		|	Тренировка.Стиль КАК Стиль,
		|	ВТТренировка.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТФиксация
		|ИЗ
		|	РегистрНакопления.Тренировка КАК Тренировка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТренировка КАК ВТТренировка
		|		ПО Тренировка.Регистратор = ВТТренировка.Ссылка
		|			И Тренировка.НомерСтроки = ВТТренировка.НомерСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	Тренировка.Стиль,
		|	ВТТренировка.ГруппаМышц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТТренировка.Период КАК Период,
		|	ТТренировка.Ссылка КАК ТренировкаСсылка,
		|	ТТренировка.Стиль КАК Стиль,
		|	ТТренировка.ГруппаМышц КАК ГруппаМышц
		|ИЗ
		|	ВТТренировка КАК ТТренировка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФиксация КАК ТФиксация
		|		ПО ТТренировка.Период = ТФиксация.Период
		|			И ТТренировка.Стиль = ТФиксация.Стиль
		|УПОРЯДОЧИТЬ ПО
		|	ТТренировка.ГруппаМышц ВОЗР,
		|	ТТренировка.Период УБЫВ";
#КонецОбласти

	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОтветСтруктура = Новый Структура;
		ОтветСтруктура.Вставить("ТренировкаСсылка");
		ОтветСтруктура.Вставить("ГруппаМышц");
		ОтветСтруктура.Вставить("Стиль");		
		ОтветСтруктура.Вставить("Дни");
		
		ОтветСтруктура.ТренировкаСсылка	= Выборка.ТренировкаСсылка;
		ОтветСтруктура.ГруппаМышц		= Выборка.ГруппаМышц;
		ОтветСтруктура.Стиль			= Строка(Выборка.Стиль);
		РазницаВДнях 					= (НачалоДня(ТекущаяДата()) - НачалоДня(Выборка.Период)) / (60 * 60 * 24);  
		ОтветСтруктура.Дни 				= РазницаВДнях;
		
		Ответ.Добавить(ОтветСтруктура);
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Тренировка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Тренировка.Дата,
	|	Тренировка.Спортсмен,
	|	Тренировка.ЖурналТренировок.(
	|		НомерСтроки,
	|		Упражнение,
	|		Стиль,
	|		Повторы
	|	)
	|ИЗ
	|	Документ.Тренировка КАК Тренировка
	|ГДЕ
	|	Тренировка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЖурналТренировокШапка = Макет.ПолучитьОбласть("ЖурналТренировокШапка");
	ОбластьЖурналТренировок = Макет.ПолучитьОбласть("ЖурналТренировок");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЖурналТренировокШапка);
		ВыборкаЖурналТренировок = Выборка.ЖурналТренировок.Выбрать();
		Пока ВыборкаЖурналТренировок.Следующий() Цикл
			ОбластьЖурналТренировок.Параметры.Заполнить(ВыборкаЖурналТренировок);
			ТабДок.Вывести(ОбластьЖурналТренировок, ВыборкаЖурналТренировок.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
