
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Тренировка.Записывать = Истина;
	Для Каждого ТекСтрокаЖурналТренировок Из ЖурналТренировок Цикл
		Движение 				= Движения.Тренировка.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Спортсмен 		= Спортсмен;
		Движение.Упражнение 	= ТекСтрокаЖурналТренировок.Упражнение;
		Движение.Стиль 			= ТекСтрокаЖурналТренировок.Стиль;
		Движение.Очередь 		= ТекСтрокаЖурналТренировок.НомерСтроки;
		Движение.Повторы 		= ТекСтрокаЖурналТренировок.Повторы;
		Движение.Комментарий 	= Комментарий;
		Движение.Дата 			= Дата;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область Инициализация
#КонецОбласти