
#Область ПрограммныйИнтерфейс

Функция ПолучитьВесСпортсменаСрезПоследних(Период, Спортсмен) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АнтропометрияСрезПоследних.Спортсмен КАК Спортсмен,
		|	АнтропометрияСрезПоследних.ПВХ КАК ПВХ,
		|	АнтропометрияСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.Антропометрия.СрезПоследних(&Период) КАК АнтропометрияСрезПоследних
		|ГДЕ
		|	АнтропометрияСрезПоследних.Спортсмен = &Спортсмен
		|	И АнтропометрияСрезПоследних.ПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Вес)";
	
	Запрос.УстановитьПараметр("Период", 	Период);
	Запрос.УстановитьПараметр("Спортсмен", 	Спортсмен);
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	результатВес 			= 0;

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		результатВес = ВыборкаДетальныеЗаписи.Вес;
	КонецЕсли;	
	
	Возврат результатВес;
	
КонецФункции

Функция ПолучитьКоличествоПодходовЗаТренировку(Тренировка, Упражнение, Стиль, ЕдИзм) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Тренировка.Упражнение КАК Упражнение,
		|	Тренировка.Стиль КАК Стиль,
		|	Тренировка.ЕдИзм КАК ЕдИзм,
		|	Тренировка.Регистратор КАК Регистратор,
		|	КОЛИЧЕСТВО(Тренировка.Вес) КАК КоличествоПодходов
		|ИЗ
		|	РегистрНакопления.Тренировка КАК Тренировка
		|ГДЕ
		|	Тренировка.Регистратор = &Регистратор
		|	И Тренировка.Упражнение = &Упражнение
		|	И Тренировка.Стиль = &Стиль
		|	И Тренировка.ЕдИзм = &ЕдИзм
		|
		|СГРУППИРОВАТЬ ПО
		|	Тренировка.Регистратор,
		|	Тренировка.Упражнение,
		|	Тренировка.Стиль,
		|	Тренировка.ЕдИзм";
	
	Запрос.УстановитьПараметр("Регистратор", Тренировка);
	Запрос.УстановитьПараметр("Упражнение", Упражнение);
	Запрос.УстановитьПараметр("Стиль", 		Стиль);
	Запрос.УстановитьПараметр("ЕдИзм", 		ЕдИзм);
	
	РезультатЗапроса 			= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 		= РезультатЗапроса.Выбрать();
	результатКоличествоПодходов = 0;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		результатКоличествоПодходов = ВыборкаДетальныеЗаписи.КоличествоПодходов;
	КонецЕсли;	
	
	Возврат результатКоличествоПодходов;
	
КонецФункции

Функция ВычислитьВозраст(ДатаРождения) Экспорт

	Возраст = Год(Текущаядата()) - Год(ДатаРождения);	
	
	ДеньТекущий = День(Текущаядата());
	МесяцТекущий = Месяц(ТекущаяДата());
	
	ДеньРождения = День(ДатаРождения);
	МесяцРождения = Месяц(ДатаРождения);
	
	Если МесяцРождения < МесяцТекущий ИЛИ (МесяцРождения = МесяцТекущий И ДеньРождения > ДеньТекущий) Тогда
		
		Возраст = Возраст - 1;

	КонецЕсли;
	
	Возврат Возраст;	

КонецФункции 

Функция ВозрастПрописью(Возраст) Экспорт

	Параметры = "год, года, лет, м,,,,,0";	
	Пропись = ЧислоПрописью(Возраст,, Параметры);
	Возврат Пропись;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти