
#Область ОписаниеПеременных
#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура СнятьФлагОтслеживатьВосстановление(СсылкаИсключение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Упражнение.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Спортсмен КАК Упражнение
		|ГДЕ
		|	Упражнение.Отслеживать
		|	И Упражнение.Ссылка <> &СсылкаИсключение";
	
	Запрос.УстановитьПараметр("СсылкаИсключение", СсылкаИсключение);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УпражнениеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		УпражнениеОбъект.Отслеживать = Ложь;
		УпражнениеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область Инициализация
#КонецОбласти